Sets dimension equality formats
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting> formattingArr
)
  Visual Basic
Public Sub SetEqualityFormula ( _
	formattingArr As IList(Of DimensionEqualityLabelFormatting) _
)
  Visual C++
public:
void SetEqualityFormula(
	IList<DimensionEqualityLabelFormatting^>^ formattingArr
)
 Parameters
  formattingArr
 Type:  System.Collections.Generic IList   DimensionEqualityLabelFormatting
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  DimensionType Class
  Autodesk.Revit.DB Namespace